[{"id":"913e5b7b-c4ae-4df9-8b0b-8865886ffb16","contact":{"email":"robertkelley1987@gmail.com","phone":"(774) 364-3298"},"billingAddress":{"firstName":"Robert","lastName":"Kelley","streetLine1":"26 Hamlet St","streetLine2":"Unit 3","city":"Somerville","state":"Massachusetts","zip":"02143"},"shippingAddress":{"firstName":"Robert","lastName":"Kelley","streetLine1":"26 Hamlet St","streetLine2":"Unit 3","city":"Somerville","state":"Massachusetts","zip":"02143"},"shippingMethod":{"name":"Standard","days":"5 - 7","cost":9.99},"cart":[{"product":{"id":"nails-hatred-ad-infinitum-t-shirt","category":"Apparel","featured":true,"productType":"T-Shirt","artist":"Nails","imgs":["nails_hatred-ad-infinitum-t-shirt"],"desc":"Hatred Ad Infinitum","color":"Black","manufacturer":"Gildan","material":"100% Cotton","price":24.99,"dateAdded":"2012-05-20T04:00:00.000Z"},"qty":1,"size":"Small","link":"/apparel/featured/products/nails-hatred-ad-infinitum-t-shirt"}]},{"id":"2083e166-d9d5-4189-9dfd-a9ea607b4b3c","contact":{"email":"robertkelley1987@gmail.com","phone":"(774) 364-3298"},"billingAddress":{"firstName":"Robert","lastName":"Kelley","streetLine1":"26 Hamlet St","streetLine2":"Unit 3","city":"Somerville","state":"Massachusetts","zip":"02143"},"shippingAddress":{"firstName":"Robert","lastName":"Kelley","streetLine1":"26 Hamlet St","streetLine2":"Unit 3","city":"Somerville","state":"Massachusetts","zip":"02143"},"shippingMethod":{"name":"Standard","days":"5 - 7","cost":9.99},"cart":[{"product":{"id":"emma-ruth-rundle-live-at-roadburn-2xlp","category":"Music","featured":false,"productType":"2XLP","artist":"Emma Ruth Rundle","imgs":["emma-ruth-rundle_live-at-roadburn-cover","emma-ruth-rundle_live-at-roadburn-2xlp_1"],"desc":"Live at Roadburn","price":29.99,"dateAdded":"2023-07-07T04:00:00.000Z","tracklist":["Return","Blooms of Oblivion","Body","The Company","Dancing Man","Razor's Edge","Citadel","In My Afterlife","Pump Organ Song"],"albumDesc":["\"Roadburn has been such an important place for me and my evolution as an artist. The opportunity to perform Engine of Hell in full there in 2022 was the end of something… and the beginning of this whole new chapter in my life and art. I really do feel free is so many ways. I wanted to commemorate and honor the experience by making my Live at Roadburn album my first self release in 13 years. I will always treasure the Roadburn community.\""]},"qty":1,"link":"/music/vinyl/products/emma-ruth-rundle-live-at-roadburn-2xlp"},{"product":{"id":"chat-pile-gods-country-lp","category":"Music","featured":true,"productType":"LP","artist":"Chat Pile","imgs":["chat-pile_gods-country-cover","chat-pile_gods-country-lp_1"],"desc":"God's Country","price":21.99,"dateAdded":"2022-07-20T04:00:00.000Z","tracklist":["Slaughterhouse","Why","Pamela","Wicked Puppet Dance","Anywhere","Tropical Beaches, Inc.","The Mask","I Don't Care If I Burn","grimace_smoking_weed.jpeg"],"albumDesc":["There's a sick irony to how a country that extols rhetoric of individual freedom, in the same gasp, has no problem commodifying human life as if it were meat to feed the insatiable hunger of capitalism. If this is American nihilism taken to its absolute zenith, then God's Country, the first full length record from Oklahoma City noise rock quartet Chat Pile is the aural embodiment of such a concept.","Having lived alongside the heaps of toxic refuse that the band derives its name from, the fatalism of daily life in the American Midwest permeates throughout the works of Chat Pile, and especially so on its debut LP. Exasperated by the pandemic, the hopelessness of climate change, the cattle shoot of global capitalism, and fueled by “...lots and lots and lots and lots and lots and lots of THC,” God's Country is as much of an acknowledgement of the Earth's most assured demise as it is a snarling violent act of defiance against it. Within its over 40 minute runtime, God's Country displays both Chat Pile's most aggressively unhinged and contemplatively nuanced moments to date, drawing from its preceding two EPs and its score for the 2021 film, Tenkiller. In the band's own words, the album is, at its heart, “Oklahoma's specific brand of misery.” A misery intent on taking all down with it and its cacophonous chaos on its own terms as opposed to idly accepting its otherwise assured fall. This is what the end of the world sounds like. God's Country is out via The Flenser.","In just a couple of years, Oklahoma City's Chat Pile has made nothing short of a profound impression on the underground music discourse. Formed in the spring of 2019 by Raygun Busch (vocals), Luther Manhole (Guitar), Stin (Bass), and Captain Ron (Drums), the noise-rock quartet would release two EPs that same year, titled This Dungeon Earth and Remove Your Skin Please respectively. Spurred on by both a hearty run of live performances and a swiftly growing online fanbase, Chat Pile became a staple name among its genre contemporaries thanks to its hellish synthesis of noise rock, sludge, industrial, and mid 90's nu-metal. In 2020, the band would sign with San Francisco underground music label, The Flenser, to put out its upcoming full length debut. That following year, Chat Pile kept its roll going, with accolades including composing the score for the indie film, Tenkiller, as well as releasing a 7” split with portrayal of guilt in the summer. Despite its creation only a couple of years ago, Chat Pile has already played alongside a number of acclaimed underground acts, including Street Sects, portrayal of guilt, Psychic Graveyard and Distorted Pony ."]},"qty":1,"link":"/artists/chat-pile/music/chat-pile-gods-country-lp"}]}]